In [1]:
%load_ext sql

In [2]:
%sql sqlite:///week1

u'Connected: @week1'

In [3]:
%%sql
CREATE TABLE articles (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    username varchar(255),
    time datetime,
    article_id varchar(255)
);

 * @week1
 * sqlite:///week1
(sqlite3.OperationalError) table articles already exists [SQL: u'CREATE TABLE articles (\n    id INTEGER PRIMARY KEY AUTOINCREMENT,\n    username varchar(255),\n    time datetime,\n    article_id varchar(255)\n);']

In [4]:
%sql insert into articles (username, time, article_id) values("John", "2015-07-19 18:46:49", "3")
%sql insert into articles (username, time, article_id) values("John", "2015-07-19 18:46:52", "2")
%sql insert into articles (username, time, article_id) values("John", "2015-07-19 18:46:54", "1")
%sql insert into articles (username, time, article_id) values("John", "2015-07-19 18:46:56", "10")
%sql insert into articles (username, time, article_id) values("John", "2015-07-19 18:46:58", "12")
%sql insert into articles (username, time, article_id) values("Mike", "2015-07-19 18:47:00", "2")
%sql insert into articles (username, time, article_id) values("Lori", "2015-07-19 18:47:02", "21")
%sql insert into articles (username, time, article_id) values("Lori", "2015-07-19 18:47:05", "10")
%sql insert into articles (username, time, article_id) values("Lori", "2015-07-19 18:47:07", "2")

 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.
 * @week1
 * sqlite:///week1
1 rows affected.

[]

In [5]:
%sql select * from articles

 * @week1
 * sqlite:///week1
Done.

[(1, u'John', u'2015-07-19 18:46:49', u'3'),
 (2, u'John', u'2015-07-19 18:46:52', u'2'),
 (3, u'John', u'2015-07-19 18:46:54', u'1'),
 (4, u'John', u'2015-07-19 18:46:49', u'3'),
 (5, u'John', u'2015-07-19 18:46:52', u'2'),
 (6, u'John', u'2015-07-19 18:46:54', u'1'),
 (7, u'John', u'2015-07-19 18:46:56', u'10'),
 (8, u'John', u'2015-07-19 18:46:58', u'12'),
 (9, u'Mike', u'2015-07-19 18:47:00', u'2'),
 (10, u'Lori', u'2015-07-19 18:47:02', u'21'),
 (11, u'Lori', u'2015-07-19 18:47:05', u'10'),
 (12, u'Lori', u'2015-07-19 18:47:07', u'2'),
 (13, u'John', u'2015-07-19 18:46:49', u'3'),
 (14, u'John', u'2015-07-19 18:46:52', u'2'),
 (15, u'John', u'2015-07-19 18:46:54', u'1'),
 (16, u'John', u'2015-07-19 18:46:56', u'10'),
 (17, u'John', u'2015-07-19 18:46:58', u'12'),
 (18, u'Mike', u'2015-07-19 18:47:00', u'2'),
 (19, u'Lori', u'2015-07-19 18:47:02', u'21'),
 (20, u'Lori', u'2015-07-19 18:47:05', u'10'),
 (21, u'Lori', u'2015-07-19 18:47:07', u'2')]

In [11]:
%sql SELECT username, COUNT(article_id) as count FROM articles GROUP BY username ORDER BY count DESC LIMIT 1;

 * @week1
 * sqlite:///week1
Done.

[(u'John', 13)]

In [35]:
%sql SELECT * FROM (SELECT username, COUNT(article_id) as count FROM articles GROUP BY username) as temp WHERE temp.count = 2;

 * @week1
 * sqlite:///week1
Done.

[(u'Mike', 2)]

In [41]:
%sql SELECT username, COUNT(article_id) as count FROM articles WHERE count = 2 GROUP BY username;

 * @week1
 * sqlite:///week1
(sqlite3.OperationalError) misuse of aggregate: COUNT() [SQL: u'SELECT username, COUNT(article_id) as count FROM articles WHERE count = 2 GROUP BY username;']

In [52]:
%sql SELECT username, count FROM (SELECT username, COUNT(article_id) as count FROM articles GROUP BY username) where count >=3;

 * @week1
 * sqlite:///week1
Done.

[(u'John', 13), (u'Lori', 6)]

In [54]:
%%sql
CREATE VIEW temp_view AS
SELECT username, COUNT(article_id) as count FROM articles GROUP BY username;

 * @week1
 * sqlite:///week1
Done.

[]

In [55]:
%sql SELECT username, count FROM temp_view WHERE count > 2

 * @week1
 * sqlite:///week1
Done.

[(u'John', 13), (u'Lori', 6)]

In [59]:
%sql WITH temp AS (SELECT username, COUNT(article_id) as counts FROM articles GROUP BY username) SELECT username, counts FROM temp WHERE counts > 2;

 * @week1
 * sqlite:///week1
Done.

[(u'John', 13), (u'Lori', 6)]

In [61]:
%sql SELECT username, COUNT(article_id) as count FROM articles GROUP BY username;

 * @week1
 * sqlite:///week1
Done.

[(u'John', 13), (u'Lori', 6), (u'Mike', 2)]

In [ ]:
# SELECT player_name,
#        year,
#        CASE WHEN year = 'SR' THEN 'yes'
#             ELSE NULL END AS is_a_senior
#   FROM benn.college_football_players

In [78]:
%%sql 
SELECT username, count, CASE WHEN count >= 3 THEN 'avid' ELSE 'causal' END AS reader_type FROM temp_view;

 * @week1
 * sqlite:///week1
Done.

[(u'John', 13, u'avid'), (u'Lori', 6, u'avid'), (u'Mike', 2, u'causal')]

In [86]:
%sql SELECT username, time, article_id FROM articles GROUP BY username;

 * @week1
 * sqlite:///week1
Done.

[(u'John', u'2015-07-19 18:46:58', u'12'),
 (u'Lori', u'2015-07-19 18:47:07', u'2'),
 (u'Mike', u'2015-07-19 18:47:00', u'2')]

In [80]:
%sql select * from articles

 * @week1
 * sqlite:///week1
Done.

[(1, u'John', u'2015-07-19 18:46:49', u'3'),
 (2, u'John', u'2015-07-19 18:46:52', u'2'),
 (3, u'John', u'2015-07-19 18:46:54', u'1'),
 (4, u'John', u'2015-07-19 18:46:49', u'3'),
 (5, u'John', u'2015-07-19 18:46:52', u'2'),
 (6, u'John', u'2015-07-19 18:46:54', u'1'),
 (7, u'John', u'2015-07-19 18:46:56', u'10'),
 (8, u'John', u'2015-07-19 18:46:58', u'12'),
 (9, u'Mike', u'2015-07-19 18:47:00', u'2'),
 (10, u'Lori', u'2015-07-19 18:47:02', u'21'),
 (11, u'Lori', u'2015-07-19 18:47:05', u'10'),
 (12, u'Lori', u'2015-07-19 18:47:07', u'2'),
 (13, u'John', u'2015-07-19 18:46:49', u'3'),
 (14, u'John', u'2015-07-19 18:46:52', u'2'),
 (15, u'John', u'2015-07-19 18:46:54', u'1'),
 (16, u'John', u'2015-07-19 18:46:56', u'10'),
 (17, u'John', u'2015-07-19 18:46:58', u'12'),
 (18, u'Mike', u'2015-07-19 18:47:00', u'2'),
 (19, u'Lori', u'2015-07-19 18:47:02', u'21'),
 (20, u'Lori', u'2015-07-19 18:47:05', u'10'),
 (21, u'Lori', u'2015-07-19 18:47:07', u'2')]

In [89]:
%sql SELECT article_id, COUNT(username) as count FROM articles GROUP BY article_id;

 * @week1
 * sqlite:///week1
Done.

[(u'1', 3), (u'10', 4), (u'12', 2), (u'2', 7), (u'21', 2), (u'3', 3)]